'''
A. Упаковка прямоугольников
ограничение по времени на тест 2 секунды
ограничение по памяти на тест 512 мегабайт
Есть 𝑛 прямоугольников одинакового размера: 𝑤 в ширину и ℎ в длину. Требуется найти квадрат минимального размера,
в который можно упаковать данные прямоугольники. Прямоугольники при этом нельзя поворачивать.


Входные данные
Ввод содержит три целых числа: 𝑤, ℎ, 𝑛 (1≤𝑤,ℎ,𝑛≤10^9).

Выходные данные
Выведите минимальную длину стороны квадрата, в который можно упаковать заданные прямоугольники.

Пример
входные данные
2 3 10
выходные данные
9
'''